pyocd/pyOCD/pyocd/debug/svd/data/HC32F451.svd
                <register>
                    <name>XTALSTDSR</name>
                    <description>desc XTALSTDSR</description>
                    <addressOffset>0x41</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTDF</name>
                            <description>desc XTALSTDF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MRCTRM</name>
                    <description>desc MRCTRM</description>
                    <addressOffset>0x61</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>HRCTRM</name>
                    <description>desc HRCTRM</description>
                    <addressOffset>0x62</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>XTALSTBCR</name>
                    <description>desc XTALSTBCR</description>
                    <addressOffset>0xA2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x5</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTB</name>
                            <description>desc XTALSTB</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLCFGR</name>
                    <description>desc PLLCFGR</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x11101300</resetValue>
                    <resetMask>0xFFF1FF9F</resetMask>
                    <fields>
                        <field>
                            <name>MPLLM</name>
                            <description>desc MPLLM</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLSRC</name>
                            <description>desc PLLSRC</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPLLN</name>
                            <description>desc MPLLN</description>
                            <msb>16</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPLLR</name>
                            <description>desc MPLLR</description>
                            <msb>23</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPLLQ</name>
                            <description>desc MPLLQ</description>
                            <msb>27</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPLLP</name>
                            <description>desc MPLLP</description>
                            <msb>31</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UPLLCFGR</name>
                    <description>desc UPLLCFGR</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x11101300</resetValue>
                    <resetMask>0xFFF1FF1F</resetMask>
                    <fields>
                        <field>
                            <name>UPLLM</name>
                            <description>desc UPLLM</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UPLLN</name>
                            <description>desc UPLLN</description>
                            <msb>16</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UPLLR</name>
                            <description>desc UPLLR</description>
                            <msb>23</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UPLLQ</name>
                            <description>desc UPLLQ</description>
                            <msb>27</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UPLLP</name>
                            <description>desc UPLLP</description>
                            <msb>31</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALCFGR</name>
                    <description>desc XTALCFGR</description>
                    <addressOffset>0x410</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xF0</resetMask>
                    <fields>
                        <field>
                            <name>XTALDRV</name>
                            <description>desc XTALDRV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALMS</name>
                            <description>desc XTALMS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUPDRV</name>
                            <description>desc SUPDRV</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTAL32CR</name>
                    <description>desc XTAL32CR</description>
                    <addressOffset>0x420</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32STP</name>
                            <description>desc XTAL32STP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTAL32CFGR</name>
                    <description>desc XTAL32CFGR</description>
                    <addressOffset>0x421</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32DRV</name>
                            <description>desc XTAL32DRV</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTAL32NFR</name>
                    <description>desc XTAL32NFR</description>
                    <addressOffset>0x425</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>XTAL32NF</name>
                            <description>desc XTAL32NF</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRCCR</name>
                    <description>desc LRCCR</description>
                    <addressOffset>0x427</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>LRCSTP</name>
                            <description>desc LRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRCTRM</name>
                    <description>desc LRCTRM</description>
                    <addressOffset>0x429</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
